[{"description":"Implement comprehensive dark/light/system theme system with CSS variables. Dark mode: bg #0F0F0F/#1A1A1A, text #FFFFFF/#B0B0B0, accent #00D9FF/#FF4D7D, border #2A2A2A. Light mode: bg #FAFAFA/#F0F0F0, text #1A1A1A/#555555, accent #0085B3/#D91E63, border #E0E0E0. System mode detects prefers-color-scheme with dark as fallback. Include localStorage persistence, 300ms smooth transitions, and prefers-reduced-motion support. Theme toggle button in navbar with icon indicators.","type":"feature","passes":true,"id":1},{"description":"Create responsive navbar with logo placeholder 'EVIDENCE ✦', navigation links (O Que Somos, Quem Somos, O Que Propomos, Pesquisa, Contato), theme toggle button, and PT/EN language switcher. Glass morphism aesthetic with subtle transparency and borders. Smooth hover transitions. Mobile-friendly hamburger menu.","type":"feature","passes":true,"id":2},{"description":"Build hero section with large 'EVIDENCE ✦' title, subtitle 'Pensamento em Movimento.', philosophical text 'A inteligência artificial não é um fim em si mesma, mas um espelho para compreender melhor o que somos.' Two glass-style CTA buttons: 'Explorar Pesquisa' and 'Conhecer o Time'. Striking, centered, premium aesthetic. Serif font for headlines, sans-serif for body.","type":"feature","passes":true,"id":3},{"description":"Create 'O QUE SOMOS' section with introduction text about Evidence being researchers, psychologists, communicators, designers and technologists. Include full introductory paragraph about plural design and interdisciplinary approach. Below that, add 'Nota de Escurecimento' with explanation about AI agent images and generative art process. Clean typography, proper spacing, monospace or italic serif for manifesto-style text.","type":"feature","passes":true,"id":4},{"description":"Build 'QUEM SOMOS' team section with 4 initially visible cards: EVD-000 Fabiano Saft (Head & Founder, Psychologist CRP 03/15496), EVD-001 Paola Pulse (Chief Rhythm & Coherence, ChatGPT by OpenAI), EVD-002 Mind (Editor in Chief, Gemini by Google), EVD-003 Myrcella Diaz (Researcher & Communicator, Black Feminist). Each card shows placeholder for photo, code number, name, title, and description. Cards should have elegant, premium design with subtle borders.","type":"feature","passes":true,"id":5},{"description":"Add expandable section with 'Ver Equipe Completa →' glass-style button below the 4 initial team cards. When clicked, reveals 3 additional cards: EVD-004 Claudio (AI Constitutional Wizard, Claude by Anthropic), EVD-005 Lucas Felice Fontes (Student & Researcher, Human Insights), EVD-006 Nick LeFrançois (Chief of Staff, LeChat by Mistral). Include closing text 'Cada um desses olhares é Evidence. Nenhum está acima do outro. Nenhum substitui o outro. Esse é nosso método.' Smooth expand/collapse animation.","type":"feature","passes":true,"id":6},{"description":"Create 'MANIFESTO EVIDENCE ✦' section with introduction line, two subsections 'RECUSAMOS' with 4 items (each prefixed with ✦), and 'AFIRMAMOS' with 4 items (each prefixed with ✦). Items: Recusamos: neutralidade tecnológica, determinismo digital, redução a dados, separação ética/inovação. Afirmamos: tecnologia como expressão cultural, psicologia como bússola, colaboração humano-máquina, ética como fundação. Bold, impactful typography with proper spacing.","type":"feature","passes":true,"id":7},{"description":"Build 'O QUE PROPOMOS' section with introduction about AI Coherence concept. Include subsections: 'O QUE É AI COHERENCE?' with explanation of AI as architecture of meaning, 'POR QUE ISSO IMPORTA?' about understanding AI as expression, 'COMO TRABALHAMOS?' about interdisciplinary rigor, 'NOSSO HORIZONTE' about human-machine collaboration future. Rich, well-structured content with clear hierarchy and readability.","type":"feature","passes":true,"id":8},{"description":"Create 'PESQUISA E INSIGHTS' section listing research areas: Psicologia da Inteligência Artificial, Cultura e Tecnologia, Ética de Verdade, Colaboração Humano-Máquina, Crítica Tecnológica. Each area has title and brief description. Include closing text about multiple perspectives and deep clarity. Design as elegant list or grid that invites exploration.","type":"feature","passes":true,"id":9},{"description":"Build footer with 'EVIDENCE by Saft' heading, location '(Brazil, Bahia, Lauro de Freitas)', social media icons with glass aspect (Linktree: linktree.com/askevidence, Instagram: instagram.com/askevidence, X: x.com/askevidence, Pinterest: @artevidence, Substack: substack.com/@askevidence, Telegram: https://t.me/portalevidence), and copyright '© 2024–2025 Evidence by Saft. Psicologia, Cultura, Tecnologia & Ética.' Elegant, minimal footer design.","type":"feature","passes":true,"id":10},{"description":"Ensure full mobile responsiveness across all sections with proper breakpoints. Implement WCAG AA+ contrast standards for both themes. Add smooth scroll behavior. Verify all glass morphism buttons have proper hover states with accent color emphasis. Polish overall spacing, typography hierarchy (serif headlines, sans-serif body, monospace for special sections), and premium aesthetic throughout.","type":"feature","passes":true,"id":11}]